In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
dts = pd.Series(["Yash","A","A","D"])

In [3]:
dts

0    Yash
1       A
2       A
3       D
dtype: object

In [4]:
dt = pd.Series(["Red","Black","Blue","Black"])

In [5]:
dt

0      Red
1    Black
2     Blue
3    Black
dtype: object

In [6]:
car = pd.DataFrame({"Names":dts,"Colors":dt})

In [7]:
car

  Names Colors
0  Yash    Red
1     A  Black
2     A   Blue
3     D  Black

In [8]:
dtw = pd.read_csv('C:/Users/ADMIN/Downloads/[FreeCourseSite.com] Udemy - Complete Machine Learning and Data Science Zero to Mastery/zero-to-mastery-ml-master/data/car-sales.csv')

In [9]:
dtw

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [10]:
dtw

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
dtw.to_csv('Again_car_sale.csv', index=False)

In [12]:
dsw = pd.read_csv('Again_car_sale.csv')

In [13]:
dsw

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [14]:
dsw.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [15]:
dsw.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [16]:
dsw.index

RangeIndex(start=0, stop=10, step=1)

In [17]:
dsw.values

array([['Toyota', 'White', 150043, 4, '$4,000.00'],
       ['Honda', 'Red', 87899, 4, '$5,000.00'],
       ['Toyota', 'Blue', 32549, 3, '$7,000.00'],
       ['BMW', 'Black', 11179, 5, '$22,000.00'],
       ['Nissan', 'White', 213095, 4, '$3,500.00'],
       ['Toyota', 'Green', 99213, 4, '$4,500.00'],
       ['Honda', 'Blue', 45698, 4, '$7,500.00'],
       ['Honda', 'Blue', 54738, 4, '$7,000.00'],
       ['Toyota', 'White', 60000, 4, '$6,250.00'],
       ['Nissan', 'White', 31600, 4, '$9,700.00']], dtype=object)

In [18]:
dsw.shape

(10, 5)

In [19]:
dsw.axes

[RangeIndex(start=0, stop=10, step=1),
 Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')]

In [20]:
dsw.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [21]:
dsw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [22]:
dsw.count()

Make             10
Colour           10
Odometer (KM)    10
Doors            10
Price            10
dtype: int64

In [23]:
dsw.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [24]:
dsw.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [25]:
dsr = pd.Series([3000,5000,1200])

In [26]:
dsr

0    3000
1    5000
2    1200
dtype: int64

dsr.sum()

In [27]:
dsr.sum()

9200

In [28]:
dsr.mean()

3066.6666666666665

In [29]:
drr = dsw.loc[:, dsw.dtypes == np.int64]

drr

In [30]:
drr

   Odometer (KM)  Doors
0         150043      4
1          87899      4
2          32549      3
3          11179      5
4         213095      4
5          99213      4
6          45698      4
7          54738      4
8          60000      4
9          31600      4

In [31]:
drr.sum()

Odometer (KM)    786014
Doors                40
dtype: int64

In [32]:
drr.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [33]:
len(dsw)

10